package p4;

public class App {
    public static void main(String[] args) {
        //요일관련프로그램 
////////////////////////////////////////////////////////////////////////////////////////////////////////////

        //일 - 토 : 0~6 가독성 및 타입의 안정성의 문제가 발생함. (누군가 실수로 다른 숫자를 넣는다든지)
        // String currentDay = "월요일"; // 1번째 방법
        // int currentDay = 1; //2번째 방법
        Day currentDay = Day.MONDAY; //enum이용 방법 Day에서 지정한 값들만 담을 수 있다. 타입의 안정성 올라감 

////////////////////////////////////////////////////////////////////////////////////////////////////////////
        
        // if(currentDay.equals("일요일")){

        // } else if(currentDay.equals("월요일")){

        // }

////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // if(currentDay == 1 ){

        // } else if(currentDay == 2){

        // }
        //.... 

////////////////////////////////////////////////////////////////////////////////////////////////////////////

        if(currentDay == Day.MONDAY ){

        } else if(currentDay == Day.SUNDAY){

        }
        //.... 
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////

    //클래스 대신에 eunm이 있다
    //enum = 도메인을 정의한다. (도메인 = 한정된 정보의 범위)
    //enum이 가장 깔끔하지만.......... 외부시스템이랑 연동하거나 할때 맵핑을 위해서는 

    enum Day { 
        SUNDAY(0),
        MONDAY(1);
        //...

        private final int value;
        
        Day(int value){
            this.value = value; 
        }

        public int getValue(){ //     if(1 == Day.SUNDAY.getValue()) 이런식으로 사용함 
            return value;
        }

    }


}
